# core/title.py
from colorama import Fore
import time
import os

ascii_art = [
    " ███▄ ▄███▓ ▄▄▄       ██▀███   ██▓ ▄▄▄██▀▀▀█    ██  ▄▄▄       ███▄    █  ▄▄▄      ",
    "▓██▒▀█▀ ██▒▒████▄    ▓██ ▒ ██▒▓██▒   ▒██   ██  ▓██▒▒████▄     ██ ▀█   █ ▒████▄    ",
    "▓██    ▓██░▒██  ▀█▄  ▓██ ░▄█ ▒▒██▒   ░██  ▓██  ▒██░▒██  ▀█▄  ▓██  ▀█ ██▒▒██  ▀█▄  ",
    "▒██    ▒██ ░██▄▄▄▄██ ▒██▀▀█▄  ░██░▓██▄██▓ ▓▓█  ░██░░██▄▄▄▄██ ▓██▒  ▐▌██▒░██▄▄▄▄██ ",
    "▒██▒   ░██▒ ▓█   ▓██▒░██▓ ▒██▒░██░ ▓███▒  ▒▒█████▓  ▓█   ▓██▒▒██░   ▓██░ ▓█   ▓██▒",
    "░ ▒░   ░  ░ ▒▒   ▓▒█░░ ▒▓ ░▒▓░░▓   ▒▓▒▒░  ░▒▓▒ ▒ ▒  ▒▒   ▓▒█░░ ▒░   ▒ ▒  ▒▒   ▓▒█░",
    "░  ░      ░  ▒   ▒▒ ░  ░▒ ░ ▒░ ▒ ░ ▒ ░▒░  ░░▒░ ░ ░   ▒   ▒▒ ░░ ░░   ░ ▒░  ▒   ▒▒ ░",
    "░      ░     ░   ▒     ░░   ░  ▒ ░ ░ ░ ░   ░░░ ░ ░   ░   ▒      ░   ░ ░   ░   ▒   ",
    "       ░         ░  ░   ░      ░   ░   ░     ░           ░  ░         ░       ░  ░",
    "                                                                                  "
]


def title():
    os.system("")  # enable ANSI (Windows fix)

    print(Fore.CYAN + Fore.BLUE)
    for line in ascii_art:
        print("   " + line)
        time.sleep(0.01)
    print(Fore.RED)

    print(Fore.GREEN + " MARIJUANA1999sec Pro — Passive Recon & Web Security Framework\n" + Fore.RED)
